-- priority 1
UPDATE station
SET priority = 1
WHERE name IN (
               '4.19민주묘지', '가오리', '강일', '개롱', '개화', '거여', '고덕', '길동',
               '남태령', '당고개', '대청', '도봉산', '독바위', '둔촌동', '마들', '마천',
               '매봉', '명일', '무악재', '방화', '삼양', '삼양사거리', '상계', '상일동',
               '새절(신사)', '석수', '솔샘', '수락산', '신내', '신이문', '쌍문', '역촌',
               '응봉', '응암', '일원', '정릉', '중계', '중앙보훈병원', '하계', '학여울', '화계'
    );

-- priority 2
UPDATE station
SET priority = 2
WHERE name IN (
               '개봉', '개화산', '김포공항', '남구로', '남성', '내방', '녹천', '도림천',
               '돌곶이', '동대입구', '둔촌오륜', '먹골', '면목', '미아(서울사이버대학)', '봉천',
               '사가정', '상도', '상봉(시외버스터미널)', '서원', '수색', '신답', '신대방삼거리',
               '신정네거리', '신풍', '암사', '암사역사공원', '양천구청', '오금', '오류동',
               '온수(성공회대입구)', '용답', '용마산', '우장산', '이수', '장승배기', '제기동',
               '중곡', '중화', '증미', '천왕', '청계산입구', '학동', '홍제', '화곡'
    );

-- priority 3
UPDATE station
SET priority = 3
WHERE name IN (
               '강변(동서울터미널)', '구로', '구반포', '국회의사당', '굽은다리(강동구민회관앞)', '금호',
               '길음', '까치산', '답십리', '대모산입구', '도봉', '독립문', '마장', '망우', '미아사거리',
               '발산', '방학', '보문', '봉화산(서울의료원)', '북한산보국문', '상월곡(한국과학기술연구원)',
               '서빙고', '송정', '수유(강북구청)', '신금호', '신방화', '신정(은행정)', '애오개', '양원',
               '양천향교', '언주', '연신내', '염창', '용두(동대문구청)', '월곡(동덕여대)', '잠실나루',
               '잠실새내', '장지', '창동', '태릉입구', '한성백제', '행당', '화랑대(서울여대입구)', '녹번'
    );

-- priority 4
UPDATE station
SET priority = 4
WHERE name IN (
               '가락시장', '관악', '구룡', '구의(광진구청)', '구파발', '금천구청', '노원', '방배',
               '복정', '불광', '사평', '석계', '선유도', '솔밭공원', '신대방', '신목동', '신반포',
               '신설동', '중랑'
    );

-- priority 5
UPDATE station
SET priority = 5
WHERE name IN (
               '가좌', '강동', '강동구청', '공릉(서울과학기술대)', '관악산(서울대)', '광나루(장신대)',
               '광흥창(서강)', '군자(능동)', '대림(구로구청)', '대치', '목동', '몽촌토성(평화의문)',
               '문정', '삼전', '상왕십리', '석촌고분', '숭실대입구(살피재)', '신길', '아차산(어린이대공원후문)',
               '아현', '오목교(목동운동장앞)', '옥수', '월계', '이촌(국립중앙박물관)', '잠원', '장한평',
               '증산(명지대앞)', '창신', '청구', '충정로(경기대입구)', '한성대입구(삼선교)', '한티'
    );

-- priority 6
UPDATE station
SET priority = 6
WHERE name IN (
               '가산디지털단지', '개포동', '공항시장', '구로디지털단지', '낙성대', '당산', '대방',
               '도곡', '동대문', '등촌', '마곡', '마곡나루', '보라매', '보라매공원', '보라매병원',
               '북한산우이', '샛강', '서울대벤처타운', '서울대입구(관악구청)', '서울지방병무청', '선정릉',
               '성신여대입구(돈암)', '신당', '약수', '종로5가', '종합운동장', '총신대입구(이수)', '한양대',
               '회현(남대문시장)'
    );

-- priority 7
UPDATE station
SET priority = 7
WHERE name IN (
               '가양', '강남구청', '광운대', '교대(법원.검찰청)', '남부터미널(예술의전당)', '당곡',
               '동묘앞', '디지털미디어시티', '마포', '사당', '삼성중앙', '서대문', '서울숲', '송파나루',
               '수서', '숙대입구(갈월)', '신도림', '여의나루', '영등포구청', '영등포시장', '올림픽공원(한국체대)',
               '청량리(서울시립대입구)', '회기', '흑석(중앙대입구)'
    );

-- priority 8
UPDATE station
SET priority = 8
WHERE name IN (
               '노들', '노량진', '동대문역사문화공원', '동작(현충원)', '뚝섬', '문래', '반포', '방이',
               '삼성', '삼성(무역센터)', '서강대', '서초', '선릉', '송파', '신림', '양재(서초구청)',
               '양재시민의숲(매헌)', '어린이대공원(세종대)', '외대앞', '용산', '을지로3가', '을지로4가',
               '천호(풍납토성)', '청담', '충무로'
    );

-- priority 9
UPDATE station
SET priority = 9
WHERE name IN (
               '경복궁(정부서울청사)', '고속터미널', '광화문(세종문화회관)', '남영', '명동', '봉은사',
               '삼각지', '서울', '서울역', '석촌', '시청', '신논현', '신사', '신용산', '압구정로데오',
               '여의도', '왕십리(성동구청)', '잠실(송파구청)', '종각', '종로3가', '효창공원앞'
    );

-- priority 10
UPDATE station
SET priority = 10
WHERE name IN (
               '강남', '건대입구', '고려대(종암)', '공덕', '녹사평(용산구청)', '논현', '대흥(서강대앞)',
               '뚝섬유원지', '마포구청', '망원', '버티고개', '상수', '성수', '신촌', '안국', '안암(고대병원앞)',
               '압구정', '역삼', '영등포', '월드컵경기장(성산)', '을지로입구', '이대', '이태원', '한강진',
               '한남', '합정', '혜화', '홍대입구'
    );